Tekla Open API Reference for Tekla Structures 2025
RebarMesh.RebarMeshTypeEnum Enumeration
 The different types of reinforcement meshes.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum RebarMeshTypeEnum
Public Enumeration RebarMeshTypeEnum
Members
Member name | Value | Description
UNKNOWN_MESH | 0 |  The type of the mesh is unknown.
RECTANGULAR_MESH | 1 |  The shape of the mesh is rectangular.
POLYGON_MESH | 2 |  The shape of the mesh is a polygon. Create rectangular meshes also as polygon meshes.
BENT_MESH | 3 |  The shape of the mesh is bent.
See Also
Reference
Tekla.Structures.Model Namespace